Documents/УстановкаСоответствияТорговыхПредставителейТерриториям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>УстановкаСоответствияТорговыхПредставителейТерриториям</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СоответствиеТорговыхПредставителейТерриториям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Территории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Территория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Территории</v8:Type>
								<v8:Type>cfg:CatalogRef.ФБ_Базы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговыйПредставитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СоответствиеТорговыхПредставителейТерриториям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеТорговыхПредставителейТерриториям</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТорговыйПредставитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Территории</v8:Type>
						<v8:Type>cfg:CatalogRef.ФБ_Базы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УстановкаСоответствияТорговыхПредставителейТерриториям/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр СоответствиеТорговыхПредставителейТерриториям
	Движения.СоответствиеТорговыхПредставителейТерриториям.Записывать = Истина;
	Для Каждого ТекСтрокаТерритории Из Территории Цикл
		Движение = Движения.СоответствиеТорговыхПредставителейТерриториям.Добавить();
		Движение.Период                = Дата;
		Движение.Территория            = ТекСтрокаТерритории.Территория;
		Движение.ТорговыйПредставитель = ТекСтрокаТерритории.ТорговыйПредставитель;
	КонецЦикла;
КонецПроцедуры
